app/controllers/admin/survey_questions_controller.rb

  def create
    @survey_question = @survey.survey_questions.build(params[:survey_question])
    debugger
    if @survey_question.save
---
INSERT INTO "survey_questions" ("response_type", "survey_id", "question") VALUES('OPTION', 1, 'How many licks to the center of a tootsie roll pop?')

  def edit
    @survey_question = @survey.survey_questions.find(params[:id])
---
SELECT * FROM "survey_questions" WHERE ("survey_questions"."id" = 1 AND ("survey_questions".survey_id = 1))
SELECT * FROM "surveys" WHERE ("surveys"."id" = 1)

  def update
    params[:survey_question][:existing_survey_question_option_attributes] ||= {}
    @survey_question = @survey.survey_questions.find(params[:id])
---
SELECT * FROM "survey_questions" WHERE ("survey_questions"."id" = 1 AND ("survey_questions".survey_id = 1))
SELECT * FROM "surveys" WHERE ("surveys"."id" = 1)

  def destroy
    @survey_question = @survey.survey_questions.find(params[:id])
    @survey_question.destroy
---
SELECT * FROM "survey_questions" WHERE ("survey_questions"."id" = 1 AND ("survey_questions".survey_id = 1))
SELECT * FROM "surveys" WHERE ("surveys"."id" = 1)
DELETE FROM "survey_questions" WHERE "id" = 1

  def load_survey
    @survey = Survey.find(params[:survey_id])
---
SELECT * FROM "surveys" WHERE ("surveys"."id" = 1)