app/controllers/admin/surveys_controller.rb

  def index
    @surveys = Survey.all
---
SELECT * FROM "surveys"

  def show
    @survey = Survey.find(params[:id])
---
SELECT * FROM "surveys" WHERE ("surveys"."id" = 1)

  def edit
    @survey = Survey.find(params[:id])
---
SELECT * FROM "surveys" WHERE ("surveys"."id" = 1)

  def update
    @survey = Survey.find(params[:id])
    if @survey.update_attributes(params[:survey])
---
SELECT * FROM "surveys" WHERE ("surveys"."id" = 1)
UPDATE "surveys" SET "description" = 'A free workshop covering the explosively productive web application framework Ruby on Rails. Learn Ruby on Rails in 10 sessions by local experts with 10+ years of experience. The following sessions will prepare you for a more agile and productive way to create web applications using Ruby on Rails:

  def destroy
    @survey = Survey.find(params[:id])
    @survey.destroy
---
SELECT * FROM "surveys" WHERE ("surveys"."id" = 2)
DELETE FROM "surveys" WHERE "id" = 2