app/controllers/survey_controller.rb

  def index
    if request.post?
      @surveyee = @survey.surveyees.build(params[:surveyee])
      if @surveyee.save
---
INSERT INTO "surveyees" ("name", "created_at", "updated_at", "survey_id", "email") VALUES('Eric Berry', '2009-05-29 18:12:55', '2009-05-29 18:12:55', 1, 'cavneb@gmail.com')

  def questions
    if session[:surveyee_id]
      @surveyee = Surveyee.find(session[:surveyee_id])
      if request.post?
        survey_questions = params["#{@survey.id}"]
        if survey_questions.length < @survey.survey_questions.length
---
SELECT * FROM "surveyees" WHERE ("surveyees"."id" = 1)
SELECT * FROM "survey_questions" WHERE ("survey_questions".survey_id = 1)

  def load_survey
    @survey = Survey.find_by_unique_code(params[:unique_code])
---
SELECT * FROM "surveys" WHERE ("surveys"."unique_code" = '4d21602c8087d653d03aedf59ebaf0d261dec16a') LIMIT 1